CSI API ETABS v1
eDesignActionType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eDesignActionType
Public Enumeration eDesignActionType
Dim instance As eDesignActionType
public enum class eDesignActionType
type eDesignActionType
Members
Member name | Value | Description
NonComposite | 1
ShortTermComposite | 2
LongTermComposite | 3
Staged | 4
Other | 5
See Also
Reference
ETABSv1 Namespace